<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
           
  <meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
           
  <meta name="author" content="G&ouml;ran St&auml;ck">
  <title>Versionsinformation</title>
</head>
  <body>
   
<h1>BlueBrims frist&aring;ende LayoutEditor version 2</h1>
  2002-12-04<br>
   
<h3>&Aring;tg&auml;rdat sedan f&ouml;reg&aring;ende version</h3>
   
<ol>
    <li>Saknad klass vid montering av EPS-bild</li>
   <li>Flytta sidelement med piltangenter fungerar inte</li>
   <li>Saknad ikon p&aring; alster i materialkatalog</li>
   <li>Sidstorlekar sparas inte.<br>
    </li>
   
</ol>
   
<h3>Att g&ouml;ra</h3>
   
<ol>
    <li>Skjuta in och ta bort en eller flera sidor</li>
    <li>Koppla sidor till valfri mallsida</li>
    <li>En sida ska kunna &auml;rva spaltindelning, marginaler fr&aring;n 
en annan sida. (Med denna funktion kan vi f&aring; mallsidor att fungera som
i Quark och de andra)</li>
    <li>Spara och l&auml;sa in mallar i separat filer. (Precis som Quark
och  de andra)</li>
    <li>Malldokument vore enkelt att g&ouml;ra genom en flagga som vid inl&auml;sning 
 s&auml;tter det inl&auml;sta dokumentet i samma tillst&aring;nd som ett nyskapat.
 Ett menyval: Spara som mall s&auml;tter flaggan i dokumentet.</li>
    <li>B&auml;ttre hantering av typsnitt. Slippa speciell katalog och dess
 font.ini fil. Utnyttja dynamisk laddning av typsnitt. Spara typsnitt i dokumentet.</li>
    <li>Bifoga n&aring;gra mall- och exempeldokument</li>
    <li>Skriva ut uppslag p&aring; separata sidor</li>
    <li>Skriva ut separata sidor p&aring; uppslag till exempel tv&aring;
A4  p&aring; ett A3 f&ouml;r att kunna skapa en dubbelvikt A4 tidning</li>
    <li>Spara som PDF</li>
    <li>Koppla p&aring; den XML-export f&ouml;r Webbpublicering som finns 
i BlueBrim-systemet.<br>
    </li>
   
</ol>
   
<h3>&nbsp;K&auml;nda fel och brister</h3>
   
<ol>
    <li>Verktyg i verktygspaletten som du skapar sj&auml;lv sparas inte i 
dokumentet.</li>
    <li>Lokalt typograferad text tappar radbrytningar vid XML-inl&auml;sning</li>
    <li>Kommandonamnet som syns i &aring;ngra-menyvalet saknar &ouml;vers&auml;ttning</li>
    <li>Rekursiv layout fungerar ej.</li>
   <li>Tjocka linjer ritas inte om i sin fulla tjocklek</li>
   <li>Lite skr&auml;p blir kvar vid omritning. Fr&auml;mst hantagen i &ouml;verkanten 
l&auml;mnar kvar skr&auml;p p&aring; vissa positioner. L&auml;tt att f&aring; 
fram genom att flytta med piltangenter</li>
   <li>Mallar har inaktiverat layoutmaskineri efter inl&auml;sning.</li>
  <li>Mottagna taggar i alstertext sparas inte.<br>
    </li>
  <br>
   
</ol>
   
<h3>Licens</h3>
  Detta program &auml;r BlueBrim AB's egendom och f&aring;r endast utnyttjas
 av utvalda f&ouml;retag och privatpersoner f&ouml;r ickekommersiella syften. 
Hela eller delar av programkoden f&aring;r inte inkluderas i andra program. 
Modifiering av programmet &auml;r till&aring;tet under f&ouml;ruts&auml;ttning 
att &auml;ven modifierad och tillagd programkod blir BlueBrims egendom. Spridning 
av programmet eller delar av programmet &auml;r inte till&aring;tet utan medgivande
fr&aring;n BlueBrim.<br>
   
<h3>Utvecklare</h3>
  G&ouml;ran St&auml;ck - Id&eacute; och design samt lite programmering<br>
  Dennis Malmstr&ouml;m - St&ouml;rre delen av programmeringen<br>
  Markus Persson - Ramverk, designm&ouml;nster och generella mekanismer.<br>
  Lasse Svad&auml;ngs - GUI-ramverk<br>
  Magnus Ihse - PostScript-generering<br>
  Johan Walles - XML<br>
  Helena &Aring;berg och Marcus Hirt - Bildhantering<br>
  Helena Rankeg&aring;rd - XML, textgeometri, aritmetiska uttryck i m&aring;ttf&auml;lt.<br>
   
<h3>BlueBrim AB</h3>
  BlueBrim AB &auml;r ett hel&auml;gt dotterbolag till AB Upsala Nya Tidning.<br>
   
<h3>&Aring;tg&auml;rdat i tidigare versioner</h3>
 
<h4> &nbsp;Version 1</h4>
 
<ol>
   <li>Layoutmaskineriet aktiveras efter XML-inl&auml;sning</li>
   <li>NullPointerException i materialkatalog fixad</li>
   <li>Lagt till detta f&ouml;nster</li>
   <li>O&auml;ndlig lop vid val av proportionell bredd eller h&ouml;jd &auml;r
 &aring;tg&auml;rdad.</li>
 
</ol>
 
<h4> </h4>
 
</body>
</html>
